#pragma once

#include "../../../includes.hpp"

//#include "fields.hpp" //includes "registers.hpp"


namespace MOSS { namespace Graphics {
	namespace Font {
		class Character8x8;
		class Character8x16;
	}
namespace VGA {


/*
Sources:
	https://en.wikipedia.org/wiki/VGA-compatible_text_mode
	http://www.osdever.net/FreeVGA/vga/vga.htm
	http://www.osdever.net/FreeVGA/vga/vgareg.htm
	http://compbio.cs.toronto.edu/repos/snowflock/xen-3.0.3/xen/drivers/video/vga.c
	http://files.osdev.org/mirrors/geezer/osd/graphics/index.htm
	http://files.osdev.org/mirrors/geezer/osd/graphics/modes.c

Overview:
	Refer to diagram: http://wiki.osdev.org/VGA_Hardware#The_CRT_Controller

	The system bus connects directly to the VGA unit, specifically its "Graphics Controller" unit,
	which comprises the bus interface and the VGA's memory's R/W logic.  The VGA memory is 4
	"plane"s of 64KiB each.  This memory is then read by the "Sequencer", which converts video
	memory to color indexes, and from there into the "CRT Controller" ("CRTC"), which draws
	pixels/characters on the actual screen.  The Sequencer and CRTC connect with the "Color Logic",
	which encapsulates a "Palette" and a "DAC" ("Digital-Analog Converter").  I encapsulate the
	whole thing as a VGA "Device".

	"Graphics Controller" (GC):
		Responsible for directing memory reads from/writes to video memory

	The VGA has many registers, all terribly arranged:
		External/General Registers

			Sequencer (Address 0x03C4, Data 0x03C5)
				http://www.osdever.net/FreeVGA/vga/seqreg.htm
				--Reset Register                 (Address +0x0000)
				--Clocking Mode Register         (Address +0x0001)
				--Map Mask Register              (Address +0x0002)
				--Character Map Select Register  (Address +0x0003)
				--Sequencer Memory Mode Register (Address +0x0004)
			Graphics Controller (Address 0x03CE, Data 0x03CF)
				http://www.osdever.net/FreeVGA/vga/graphreg.htm
				--Set/Reset Register              (Address +0x0000)
				--Enable Set/Reset Register       (Address +0x0001)
				--Color Compare Register          (Address +0x0002)
				--Data Rotate Register            (Address +0x0003)
				--Read Map Select Register        (Address +0x0004)
				--Graphics Mode Register          (Address +0x0005)
				--Miscellaneous Graphics Register (Address +0x0006)
				--Color Don't Care Register       (Address +0x0007)
				--Bit Mask Register               (Address +0x0008)
			CRTC (Address {0x03B4,0x03D4}[I/OAS], Data {0x03B5,0x03D5}[I/OAS], where bit I/OAS comes from external misc. register)
				http://www.osdever.net/FreeVGA/vga/crtcreg.htm
				--Horizontal Total Register          (Address +0x0000)
				--End Horizontal Display Register    (Address +0x0001)
				--Start Horizontal Blanking Register (Address +0x0002)
				--End Horizontal Blanking Register   (Address +0x0003)
				--Start Horizontal Retrace Register  (Address +0x0004)
				--End Horizontal Retrace Register    (Address +0x0005)
				--Vertical Total Register            (Address +0x0006)
				--Overflow Register                  (Address +0x0007)
				--Preset Row Scan Register           (Address +0x0008)
				--Maximum Scan Line Register         (Address +0x0009)
				--Cursor Start Register              (Address +0x000A)
				--Cursor End Register                (Address +0x000B)
				--Start Address High Register        (Address +0x000C)
				--Start Address Low Register         (Address +0x000D)
				--Cursor Location High Register      (Address +0x000E)
				--Cursor Location Low Register       (Address +0x000F)
				--Vertical Retrace Start Register    (Address +0x0010)
				--Vertical Retrace End Register      (Address +0x0011)
				--Vertical Display End Register      (Address +0x0012)
				--Offset Register                    (Address +0x0013)
				--Underline Location Register        (Address +0x0014)
				--Start Vertical Blanking Register   (Address +0x0015)
				--End Vertical Blanking              (Address +0x0016)
				--CRTC Mode Control Register         (Address +0x0017)
				--Line Compare Register              (Address +0x0018)
		Attribute Registers (Address R/W 0x03C0, Index/Data R 0x03C1, W 0x03C0)
			http://www.osdever.net/FreeVGA/vga/attrreg.htm

		Color Registers
			http://www.osdever.net/FreeVGA/vga/colorreg.htm
*/


class Device;

class GraphicsController;
class Memory;
class Sequencer;
//class ColorLogic;
class CRTC;


namespace Regs {


class RegisterBase {
	public:
		Device*const device;

		#ifdef MOSS_DEBUG
		char const*const name;
		#endif

	protected:
		#ifdef MOSS_DEBUG
		inline RegisterBase(Device* device, char const* name) : device(device), name(name) {}
		#else
		explicit inline RegisterBase(Device* device) : device(device) {}
		#endif

	public:
		virtual uint8_t read_raw(void) const = 0;
		virtual void write_raw(uint8_t value) = 0;

		inline bool is_set(int bit) const {
			uint8_t value = read_raw();
			return (value & (1<<bit)) > 0;
		}

		void print(void) const;
};


class ExternalRegisterBase : public RegisterBase {
	public:
		bool const writable;

		struct Ports {
			uint16_t read, write;
		};
		struct Ports const ports_mono, ports_col;

	protected:
		inline ExternalRegisterBase(Device* device, DEBUG_ONLY(char const* name COMMA) bool writable, struct Ports const& ports_mono,struct Ports const& ports_col) :
			RegisterBase(device DEBUG_ONLY(COMMA name)),
			writable(writable), ports_mono(ports_mono),ports_col(ports_col)
		{}

	public:
		virtual uint8_t read_raw(void) const override;
		virtual void write_raw(uint8_t value) override;
};

class MiscellaneousOutputRegister final : public ExternalRegisterBase {
	public:
		struct Fields final {
			uint8_t InputOutputAddressSelect : 1;
			uint8_t RAM_Enable               : 1;
			uint8_t ClockSelect              : 2;
			uint8_t                          : 1;
			uint8_t OddEvenPageSelect        : 1;
			uint8_t HorizontalSyncPolarity   : 1;
			uint8_t VerticalSyncPolarity     : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline MiscellaneousOutputRegister(Device* device) : ExternalRegisterBase(device,DEBUG_ONLY("Miscellaneous Output Register" COMMA)true,{0x03CC,0x03C2},{0x03CC,0x03C2}) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class FeatureControlRegister final : public ExternalRegisterBase { public:
	//All bits reserved
	explicit inline FeatureControlRegister(Device* device) : ExternalRegisterBase(device,DEBUG_ONLY("Feature Control Register" COMMA)true,{0x03CA,0x03BA},{0x03CA,0x03DA}) {}
};
class InputStatus0Register final : public ExternalRegisterBase {
	public:
		struct Fields final {
			uint8_t             : 4;
			uint8_t SwitchSense : 1;
			uint8_t             : 3;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline InputStatus0Register(Device* device) : ExternalRegisterBase(device,DEBUG_ONLY("Input Status Register #0" COMMA)false,{0x03C2,0},{0x03C2,0}) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class InputStatus1Register final : public ExternalRegisterBase {
	public:
		struct Fields final {
			uint8_t DisplayDisabled : 1;
			uint8_t                 : 2;
			uint8_t VerticalRetrace : 1;
			uint8_t                 : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline InputStatus1Register(Device* device) : ExternalRegisterBase(device,DEBUG_ONLY("Input Status Register #1" COMMA)false,{0x03BA,0},{0x03DA,0}) {}

		//Note: reading resets attribute registers' flip-flop to expect index.
		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};


class IndexedRegisterBase : public RegisterBase {
	public:
		struct PossiblePorts final {
			uint16_t ports[2];
		};
		struct PossiblePorts const ports_addr;
		struct PossiblePorts const ports_data;
		uint16_t const index;

	protected:
		inline IndexedRegisterBase(Device* device, DEBUG_ONLY(char const* name COMMA) struct PossiblePorts const& ports_addr,struct PossiblePorts const& ports_data, uint16_t index) :
			RegisterBase(device DEBUG_ONLY(COMMA name)),
			ports_addr(ports_addr),ports_data(ports_data), index(index)
		{}

	public:
		virtual uint8_t read_raw(void) const override;
		virtual void write_raw(uint8_t value) override;
};

class SequencerRegisterBase : public IndexedRegisterBase {
	public:
		Sequencer*const sequencer;

	protected:
		SequencerRegisterBase(Sequencer* sequencer, DEBUG_ONLY(char const* name COMMA) uint16_t index);
};
class GraphicsRegisterBase : public IndexedRegisterBase {
	public:
		GraphicsController*const graphics_controller;

	protected:
		GraphicsRegisterBase(GraphicsController* graphics_controller, DEBUG_ONLY(char const* name COMMA) uint16_t index);
};
class CRTC_RegisterBase : public IndexedRegisterBase {
	public:
		CRTC*const crtc;

	protected:
		CRTC_RegisterBase(CRTC* crtc, DEBUG_ONLY(char const* name COMMA) uint16_t index);
};

class SequencerResetRegister final : public SequencerRegisterBase {
	public:
		struct Fields final {
			uint8_t AsynchronousReset : 1;
			uint8_t SynchronousReset  : 1;
			uint8_t                   : 6;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline SequencerResetRegister(Sequencer* sequencer) : SequencerRegisterBase(sequencer,DEBUG_ONLY("Reset Register (Seq)" COMMA)0x0000) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class SequencerClockingModeRegister final : public SequencerRegisterBase {
	public:
		struct Fields final {
			uint8_t DotMode_9_8   : 1;
			uint8_t               : 1;
			uint8_t ShiftLoadRate : 1;
			uint8_t DotClockRate  : 1;
			uint8_t Shift4Enable  : 1;
			uint8_t ScreenDisable : 1;
			uint8_t               : 2;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline SequencerClockingModeRegister(Sequencer* sequencer) : SequencerRegisterBase(sequencer,DEBUG_ONLY("Clocking Mode Register (Seq)" COMMA)0x0001) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class SequencerMapMaskRegister final : public SequencerRegisterBase {
	public:
		struct Fields final {
			uint8_t MemoryPlaneWriteEnable : 4;
			uint8_t                        : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline SequencerMapMaskRegister(Sequencer* sequencer) : SequencerRegisterBase(sequencer,DEBUG_ONLY("Map Mask Register (Seq)" COMMA)0x0002) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class SequencerCharacterMapSelectRegister final : public SequencerRegisterBase {
	public:
		struct Fields final {
			//These fields are actually discontinuous, so the read/write does some extra work.
			uint8_t SelectCharacterSetA : 3;
			uint8_t SelectCharacterSetB : 3;
			uint8_t _unknown            : 2;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline SequencerCharacterMapSelectRegister(Sequencer* sequencer) : SequencerRegisterBase(sequencer,DEBUG_ONLY("Character Map Select Register (Seq)" COMMA)0x0003) {}

		struct Fields read(void) const;
		void write(struct Fields value);
};
class SequencerMemoryModeRegister final : public SequencerRegisterBase {
	public:
		struct Fields final {
			uint8_t                                         : 1;
			uint8_t ExtendedMemory                          : 1;
			uint8_t OddEvenHostMemoryWriteAddressingDisable : 1;
			uint8_t Chain4Enable                            : 1;
			uint8_t                                         : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline SequencerMemoryModeRegister(Sequencer* sequencer) : SequencerRegisterBase(sequencer,DEBUG_ONLY("Memory Mode Register (Seq)" COMMA)0x0004) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};

class GraphicsSetResetRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t SetReset : 4;
			uint8_t          : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsSetResetRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Set/Reset Register (GC)" COMMA)0x0000) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsEnableSetResetRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t EnableSetReset : 4;
			uint8_t                : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsEnableSetResetRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Enable Set/Reset Register (GC)" COMMA)0x0001) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsColorCompareRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t ColorCompare : 4;
			uint8_t              : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsColorCompareRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Color Compare Register (GC)" COMMA)0x0002) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsDataRotateRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t RotateCount      : 3;
			uint8_t LogicalOperation : 2;
			uint8_t                  : 3;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsDataRotateRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Data Rotate Register (GC)" COMMA)0x0003) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsReadMapSelectRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t ReadMapSelect : 2;
			uint8_t               : 6;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsReadMapSelectRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Read Map Select Register (GC)" COMMA)0x0004) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsModeRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t WriteMode                             : 2;
			uint8_t                                       : 1;
			uint8_t ReadMode                              : 1;
			uint8_t HostOddEvenMemoryReadAddressingEnable : 1;
			uint8_t ShiftRegisterInterleaveMode           : 1;
			uint8_t ShiftModeColor256                     : 1;
			uint8_t                                       : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsModeRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Graphics Mode Register (GC)" COMMA)0x0005) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsMiscellaneousRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t AlphanumericModeDisable : 1;
			uint8_t ChainOddEvenEnable      : 1;
			uint8_t MemoryMapSelect         : 2;
			uint8_t                         : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsMiscellaneousRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Miscellaneous Graphics Register (GC)" COMMA)0x0006) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsColorDontCareRegister final : public GraphicsRegisterBase {
	public:
		struct Fields final {
			uint8_t ColorDontCare : 4;
			uint8_t               : 4;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline GraphicsColorDontCareRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Color Don't-Care Register (GC)" COMMA)0x0007) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class GraphicsBitmaskRegister final : public GraphicsRegisterBase {
	public:
		explicit inline GraphicsBitmaskRegister(GraphicsController* graphics_controller) : GraphicsRegisterBase(graphics_controller,DEBUG_ONLY("Bitmask Register (GC)" COMMA)0x0008) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};

class CRTC_HorizontalTotalRegister final : public CRTC_RegisterBase {
	public:
		explicit inline CRTC_HorizontalTotalRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Horizontal Total Register (CRTC)" COMMA)0x0000) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};
class CRTC_EndHorizontalDisplayRegister final : public CRTC_RegisterBase {
	public:
		explicit inline CRTC_EndHorizontalDisplayRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("End Horizontal Display Register (CRTC)" COMMA)0x0001) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};
class CRTC_StartHorizontalBlankingRegister final : public CRTC_RegisterBase {
	public:
		explicit inline CRTC_StartHorizontalBlankingRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Start Horizontal Blanking Register (CRTC)" COMMA)0x0002) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};
class CRTC_EndHorizontalBlankingRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t EndHorizontalBlanking_Bits04 : 5;
			uint8_t DisplayEnableSkew            : 2;
			uint8_t EnableVerticalRetraceAccess  : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_EndHorizontalBlankingRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("End Horizontal Blanking Register (CRTC)" COMMA)0x0003) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_StartHorizontalRetraceRegister final : public CRTC_RegisterBase {
	public:
		explicit inline CRTC_StartHorizontalRetraceRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Start Horizontal Retrace Register (CRTC)" COMMA)0x0004) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};
class CRTC_EndHorizontalRetraceRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t EndHorizontalRetrace       : 5;
			uint8_t HorizontalRetraceSkew      : 2;
			uint8_t EndHorizontalBlanking_Bit5 : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_EndHorizontalRetraceRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("End Horizontal Retrace Register (CRTC)" COMMA)0x0005) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_VerticalTotalRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t VerticalTotal_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_VerticalTotalRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Vertical Total Register (CRTC)" COMMA)0x0006) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_OverflowRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t VerticalTotal_Bit8         : 1;
			uint8_t VerticalDisplayEnd_Bit8    : 1;
			uint8_t VerticalRetraceStart_Bit8  : 1;
			uint8_t StartVerticalBlanking_Bit8 : 1;
			uint8_t LineCompare_Bit8           : 1;
			uint8_t VerticalTotal_Bit9         : 1;
			uint8_t VerticalDisplayEnd_Bit9    : 1;
			uint8_t VerticalRetraceStart_Bit9  : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_OverflowRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Overflow Register (CRTC)" COMMA)0x0007) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_PresetRowScanRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t PresetRowScan : 5;
			uint8_t BytePanning   : 2;
			uint8_t               : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_PresetRowScanRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Preset Row Scan Register (CRTC)" COMMA)0x0008) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_MaximumScanlineRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t MaximumScanline            : 5;
			uint8_t StartVerticalBlanking_Bit9 : 1;
			uint8_t LineCompare_Bit9           : 1;
			uint8_t ScanDoubling               : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_MaximumScanlineRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Maximum Scanline Register (CRTC)" COMMA)0x0009) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_CursorStartRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t CursorScanlineStart : 5;
			uint8_t CursorDisable       : 1;
			uint8_t                     : 2;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_CursorStartRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Cursor Start Register (CRTC)" COMMA)0x000A) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_CursorEndRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t CursorScanlineEnd : 5;
			uint8_t CursorSkew        : 2;
			uint8_t                   : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_CursorEndRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Cursor End Register (CRTC)" COMMA)0x000B) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_StartAddressHighRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t StartAddress_Bits0815 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_StartAddressHighRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Start Address High Register (CRTC)" COMMA)0x000C) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_StartAddressLowRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t StartAddress_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_StartAddressLowRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Start Address Low Register (CRTC)" COMMA)0x000D) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_CursorLocationHighRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t CursorLocation_Bits0815 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_CursorLocationHighRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Cursor Location High Register (CRTC)" COMMA)0x000E) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_CursorLocationLowRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t CursorLocation_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_CursorLocationLowRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Cursor Location Low Register (CRTC)" COMMA)0x000F) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_VerticalRetraceStartRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t VerticalRetraceStart_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_VerticalRetraceStartRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Vertical Retrace Start Register (CRTC)" COMMA)0x0010) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_VerticalRetraceEndRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t VerticalRetraceEnd          : 4;
			uint8_t                             : 2;
			uint8_t MemoryRefreshBandwidth      : 1;
			uint8_t CRTC_RegistersProtectEnable : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_VerticalRetraceEndRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Vertical Retrace End Register (CRTC)" COMMA)0x0011) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_VerticalDisplayEndRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t VerticalDisplayEnd_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_VerticalDisplayEndRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Vertical Display End Register (CRTC)" COMMA)0x0012) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_OffsetRegister final : public CRTC_RegisterBase {
	public:
		explicit inline CRTC_OffsetRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Offset Register (CRTC)" COMMA)0x0013) {}

		inline uint8_t read(void) const { return read_raw(); }
		inline void write(uint8_t value) { write_raw(value); }
};
class CRTC_UnderlineLocationRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t UnderlineLocation           : 5;
			uint8_t DivideMemoryAddressClockBy4 : 1;
			uint8_t DoublewordAddressing        : 1;
			uint8_t                             : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_UnderlineLocationRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Underline Location Register (CRTC)" COMMA)0x0014) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_StartVerticalBlankingRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t StartVerticalBlanking_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_StartVerticalBlankingRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Start Vertical Blanking Register (CRTC)" COMMA)0x0015) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_EndVerticalBlankingRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t EndVerticalBlanking : 7;
			uint8_t                     : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_EndVerticalBlankingRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("End Vertical Blanking Register (CRTC)" COMMA)0x0016) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_ModeControlRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t MapDisplayAddress13         : 1;
			uint8_t MapDisplayAddress14         : 1;
			uint8_t DivideScanlineClockBy2      : 1;
			uint8_t DivideMemoryAddressClockBy2 : 1;
			uint8_t                             : 1;
			uint8_t AddressWrapSelect           : 1;
			uint8_t WordByteModeSelect          : 1;
			uint8_t SyncEnable                  : 1;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_ModeControlRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("CRTC Mode Control Register (CRTC)" COMMA)0x0017) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};
class CRTC_LineCompareRegister final : public CRTC_RegisterBase {
	public:
		struct Fields final {
			uint8_t LineCompare_Bits07 : 8;
		};
		static_assert(sizeof(struct Fields)==1,"Implementation error!");
	public:
		explicit inline CRTC_LineCompareRegister(CRTC* crtc) : CRTC_RegisterBase(crtc,DEBUG_ONLY("Line Compare Register (CRTC)" COMMA)0x0018) {}

		inline struct Fields read(void) const { uint8_t temp=read_raw(); return reinterpret_cast<struct Fields&>(temp); }
		inline void write(struct Fields value) { write_raw(reinterpret_cast<uint8_t&>(value)); }
};


}


class GraphicsController final {
	public:
		Device*const device;

	private:
		class RegsGC final { public:
			Regs::GraphicsSetResetRegister       set_reset;
			Regs::GraphicsEnableSetResetRegister set_reset_enable;
			Regs::GraphicsColorCompareRegister   color_compare;
			Regs::GraphicsDataRotateRegister     data_rotate;
			Regs::GraphicsReadMapSelectRegister  read_map_select;
			Regs::GraphicsModeRegister           graphics_mode;
			Regs::GraphicsMiscellaneousRegister  misc;
			Regs::GraphicsColorDontCareRegister  color_dont_care;
